"""Commits quiz."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
#
# * feat - добавление нового функционала в проект
# * fix - исправление багов и ошибок в проекте
# * docs - добавление/обновление документации проекта
# * style - внешнее изменение кода проекта
# * refactor - изменение кода без потери первоначальной архитектуры/идеи
# * test - изменение/добавление тестов в проект
# * build - изменения связанные со сборкой проекта/внешними зависимости
# * ci - изменение системы интеграций, например GitHub Actions
# * perf - улучшение производительности проекта, без изменений функциональности
# * chore - рутинные изменения, не попадающие под другие категории
