"""Commits quiz."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
#
# * feat - добавление нового функционала в проект
# * fix - исправление багов и ошибок в проекте
# * docs - добавление/обновление документации проекта
# * style - внешнее изменение кода проекта
# * refactor - изменение кода без потери первоначальной архитектуры/идеи
# * test - изменение/добавление тестов в проект
# * build - изменения связанные со сборкой проекта/внешними зависимости
# * ci - изменение системы интеграций, например GitHub Actions
# * perf - улучшение производительности проекта, без изменений функциональности
# * chore - рутинные изменения, не попадающие под другие категории

# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
#
# https://github.com/gorop51-2/Data-Science-For-Beginners-from-scratch-SENATOROV/commit/92705a24a2212eca2ea32cabcfc73416d5b525ed
